In [8]:
import pandas as pd
import numpy as np

In [9]:
# sanmple dataset
data = {
    'Name': ['Alice', 'Bob', None, 'David', 'Alice'],
    'Age': ['24', 'thiry', '30', None, '55'], # test scores
    'Salary': [89900, 99090, 609807, 47783, 7878], # test scores
    'Join_date': ['2025-01-01', 'not available', '2025-02-23', '2025-05-07', '2025-01-15']
} 

#Defing dataframe
df = pd.DataFrame(data)
df

    Name    Age  Salary      Join_date
0  Alice     24   89900     2025-01-01
1    Bob  thiry   99090  not available
2   None     30  609807     2025-02-23
3  David   None   47783     2025-05-07
4  Alice     55    7878     2025-01-15

## viewing Data summary

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       4 non-null      object
 1   Age        4 non-null      object
 2   Salary     5 non-null      int64
 3   Join_date  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [11]:
df.describe(include='all')

         Name  Age         Salary   Join_date
count       4    4       5.000000           5
unique      3    4            NaN           5
top     Alice   24            NaN  2025-01-01
freq        2    1            NaN           1
mean      NaN  NaN  170891.600000         NaN
std       NaN  NaN  248037.798818         NaN
min       NaN  NaN    7878.000000         NaN
25%       NaN  NaN   47783.000000         NaN
50%       NaN  NaN   89900.000000         NaN
75%       NaN  NaN   99090.000000         NaN
max       NaN  NaN  609807.000000         NaN

## checking for null values in the data

In [12]:
df.isnull().sum()

Name         1
Age          1
Salary       0
Join_date    0
dtype: int64

## Dropping or filling the missing values

In [14]:
df['Age'] = df['Age'].replace('thirty', np.nan)
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df['Age'] = df['Age'].fillna(df['Age'].mean())

df['Name'] = df['Name'].fillna('Unknown')
df['Salary'] = df['Salary'].ffill()

df.describe(include='all')# trying to display what happened

         Name        Age         Salary   Join_date
count       5   5.000000       5.000000           5
unique      4        NaN            NaN           5
top     Alice        NaN            NaN  2025-01-01
freq        2        NaN            NaN           1
mean      NaN  36.333333  170891.600000         NaN
std       NaN  11.626120  248037.798818         NaN
min       NaN  24.000000    7878.000000         NaN
25%       NaN  30.000000   47783.000000         NaN
50%       NaN  36.333333   89900.000000         NaN
75%       NaN  36.333333   99090.000000         NaN
max       NaN  55.000000  609807.000000         NaN

In [17]:
df['Join_date'] = pd.to_numeric(df['Join_date'], errors='coerce')

## droping duplicates / Getting rid of duplicates

In [18]:
df = df.drop_duplicates()

In [20]:
print(df)
print(df.dtypes)

      Name        Age  Salary  Join_date
0    Alice  24.000000   89900        NaN
1      Bob  36.333333   99090        NaN
2  Unknown  30.000000  609807        NaN
3    David  36.333333   47783        NaN
4    Alice  55.000000    7878        NaN
Name          object
Age          float64
Salary         int64
Join_date    float64
dtype: object

## Using the rename function (Optional feature)

In [24]:
df = df.rename(columns={'Names': 'First-Name', 'Salary': 'Salary($)'})

In [25]:
print(df)

      Name        Age  Salary($)  Join_date
0    Alice  24.000000      89900        NaN
1      Bob  36.333333      99090        NaN
2  Unknown  30.000000     609807        NaN
3    David  36.333333      47783        NaN
4    Alice  55.000000       7878        NaN